W8D1/Reddit/app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "post_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "wow"], ["post_id", 1], ["author_id", 1], ["created_at", "2021-02-15 22:45:09.358946"], ["updated_at", "2021-02-15 22:45:09.358946"]]
---
    def create
        @comment = current_user.comments.new(comment_params)
        if @comment.save