W8D1/Reddit/app/controllers/subs_controller.rb

    def create
        @sub = Sub.new(sub_params)
        @sub.moderator_id = current_user.id

        if @sub.save
---
INSERT INTO "subs" ("title", "moderator_id", "created_at", "updated_at", "description") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Doge Coin"], ["moderator_id", 1], ["created_at", "2021-02-15 17:18:20.485269"], ["updated_at", "2021-02-15 17:18:20.485269"], ["description", "    To da mooon"]]

    def update
        @sub = current_user.subs.find_by(id: params[:id])

        if @sub && @sub.update(sub_params)
---
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "To da mooon"], ["updated_at", "2021-02-15 17:21:19.577484"], ["id", 1]]