W8D1/Reddit/app/views/posts/_form.html.erb

        <select id="sub" name="post[sub_id]">
            <% Sub.all.each do |sub| %>
---
SELECT "subs".* FROM "subs"